stressTest.yml
config:
  target: "http://127.0.0.1:3003"
  processor: "./testStress.js"
  phases:
    # - duration: 60
    #   arrivalRate: 10
    #   rampTo: 100
    #   name: "Warm up the application"
    - duration: 120
      arrivalRate: 20
      name: "Sustained max load"
scenarios:
  - flow:
    - function: "getRandomId"
    - loop:
      - get:
          url: "/courses/{{ number }}/"
      count: 100